{
  "layers" : [
    {
      "bottom" : "x_1",
      "size_of_axes" : 1,
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "expand_dims_0",
      "top" : "expand_dims_0",
      "type" : "expand_dims",
      "name" : "expand_dims_0",
      "attributes" : {
        "basic_block_head" : 1
      }
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 2,
      "top" : "conv_0",
      "blob_weights" : 3,
      "K" : 9,
      "blob_biases" : 1,
      "name" : "conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "expand_dims_0",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "size_of_axes" : 1,
      "bottom" : "conv_0",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "input.3",
      "version" : 1,
      "top" : "input.3",
      "type" : "squeeze",
      "name" : "input.3"
    },
    {
      "bottom" : "input.3",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.5",
      "top" : "input.5",
      "type" : "activation",
      "name" : "input.5"
    },
    {
      "size_of_axes" : 1,
      "bottom" : "input.5",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "expand_dims_2",
      "top" : "expand_dims_2",
      "type" : "expand_dims",
      "name" : "expand_dims_2"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 2,
      "top" : "conv_1",
      "blob_weights" : 7,
      "K" : 64,
      "blob_biases" : 5,
      "name" : "conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "expand_dims_2",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "size_of_axes" : 1,
      "bottom" : "conv_1",
      "axes_0" : -2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "input.9",
      "version" : 1,
      "top" : "input.9",
      "type" : "squeeze",
      "name" : "input.9"
    },
    {
      "bottom" : "input.9",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.11",
      "top" : "input.11",
      "type" : "activation",
      "name" : "input.11"
    },
    {
      "axis_mode" : 1,
      "bottom" : "input.11",
      "weights" : {

      },
      "mode" : 1,
      "nd_mode" : true,
      "debug_info" : "reduce_mean_0",
      "use_version" : 1,
      "top" : "reduce_mean_0",
      "type" : "reduce",
      "name" : "reduce_mean_0"
    },
    {
      "weights" : {

      },
      "debug_info" : "concat_0",
      "top" : "concat_0",
      "type" : "copy",
      "name" : "concat_0",
      "bottom" : "reduce_mean_0"
    },
    {
      "name" : "input.13",
      "weights" : {

      },
      "dst_w" : -1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "concat_0",
      "debug_info" : "input.13",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.13"
    },
    {
      "nB" : 128,
      "top" : "linear_0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 11,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.13",
      "blob_biases" : 9,
      "has_tanh" : 0,
      "debug_info" : "linear_0",
      "name" : "linear_0",
      "has_prelu" : 0
    },
    {
      "bottom" : "linear_0",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "66",
      "top" : "var_66",
      "type" : "softmax_nd",
      "name" : "66",
      "attributes" : {
        "is_output" : 1
      }
    }
  ],
  "storage" : "model.espresso.weights",
  "metadata_in_weights" : [

  ],
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 300,
  "shape" : {
    "layer_shapes" : {
      "expand_dims_0" : {
        "k" : 9,
        "w" : 200,
        "n" : 1,
        "_rank" : 4,
        "h" : 1
      },
      "var_66" : {
        "k" : 1,
        "w" : 2,
        "n" : 1,
        "_rank" : 2,
        "h" : 1
      },
      "input.3" : {
        "k" : 1,
        "w" : 198,
        "n" : 1,
        "_rank" : 3,
        "h" : 64
      },
      "x_1" : {
        "k" : 1,
        "w" : 200,
        "n" : 1,
        "_rank" : 3,
        "h" : 9
      },
      "concat_0" : {
        "k" : 1,
        "w" : 1,
        "n" : 1,
        "_rank" : 3,
        "h" : 128
      },
      "linear_0" : {
        "k" : 1,
        "w" : 2,
        "n" : 1,
        "_rank" : 2,
        "h" : 1
      },
      "conv_1" : {
        "k" : 128,
        "w" : 198,
        "n" : 1,
        "_rank" : 4,
        "h" : 1
      },
      "input.5" : {
        "k" : 1,
        "w" : 198,
        "n" : 1,
        "_rank" : 3,
        "h" : 64
      },
      "input.11" : {
        "k" : 1,
        "w" : 198,
        "n" : 1,
        "_rank" : 3,
        "h" : 128
      },
      "expand_dims_2" : {
        "k" : 64,
        "w" : 198,
        "n" : 1,
        "_rank" : 4,
        "h" : 1
      },
      "conv_0" : {
        "k" : 64,
        "w" : 198,
        "n" : 1,
        "_rank" : 4,
        "h" : 1
      },
      "reduce_mean_0" : {
        "k" : 1,
        "w" : 1,
        "n" : 1,
        "_rank" : 3,
        "h" : 128
      },
      "input.13" : {
        "k" : 1,
        "w" : 128,
        "n" : 1,
        "_rank" : 2,
        "h" : 1
      },
      "input.9" : {
        "k" : 1,
        "w" : 198,
        "n" : 1,
        "_rank" : 3,
        "h" : 128
      }
    },
    "global_shapes" : {

    }
  },
  "subnetworks" : {

  }
}